constantAngleSlopeDNS_U4e-1_A5_H1e-2_RANSsets/TIForig/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

/*water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}*/

water
{
	transportModel HerschelBulkley;
	HerschelBulkleyCoeffs
	{
	    nu0     [0 2 -1 0 0 0 0] 1e07;
		tau0	[0 2 -2 0 0 0 0] 2e-2;
		k		[0 2 -1 0 0 0 0] 1e-3;
		n		[0 0 0 0 0 0 0]	 0.8;
	}
	rho		[1 -3 0 0 0 0 0]	100;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma            0;

// ************************************************************************* //
